---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.FilterNumericValueRule
source: html/db0a3df4-a4c2-d8ef-6214-07ed8a4b8a5d.htm
---
# FilterNumericValueRule Members

Derived classes override this method to implement the test that determines
 whether the given element passes this rule or not.